series

In [13]:
import pandas as pd
a=pd.Series()
print(a)
print(type(a))

Series([], dtype: object)
<class 'pandas.core.series.Series'>

In [14]:
x=[1,2,3,4,5]
var=pd.Series(x)
print(var)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
print(var[3])
print(var[2])

4
3

In [16]:
var=pd.Series(x, index=['a' ,'b','c','d','e'], dtype="float", name="python")
print(var)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: python, dtype: float64

In [17]:
dic={
    "name":["python", "c++","java"], 
    "pop":[12,13,14,15,16],
    "rank":[1,2,3,4,5]
    
        
}
var1=pd.Series(dic)
print(var1,type(var1))

name     [python, c++, java]
pop     [12, 13, 14, 15, 16]
rank         [1, 2, 3, 4, 5]
dtype: object <class 'pandas.core.series.Series'>

In [18]:
s=pd.Series(12,index=[1,2,3,4,5,6,7])
print(s)
s1=pd.Series(12,index=[1,2,3,4,5])
print(s1+s) # pandas work on missing value
print()

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64
1    24.0
2    24.0
3    24.0
4    24.0
5    24.0
6     NaN
7     NaN
dtype: float64

DataFrame

In [19]:
l=[1,2,3,4,5,6]
var2=pd.DataFrame(l)
print(type(l),var2)

<class 'list'>    0
0  1
1  2
2  3
3  4
4  5
5  6

In [20]:
d={'a':[1,2,3,4,5,6],'s':[1,2,3,4,5,6],1:[1,2,3,4,5,6]
   
}
var3=pd.DataFrame(d)
print(var3)

   a  s  1
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5  6  6  6

In [21]:
import pandas as pd
d={'a':[1,2,3,4,5,6],'s':[1,2,3,4,5,6],1:[1,2,3,4,5,6]}
   
var4=pd.DataFrame(d,columns=["a",1])

print(var4)
df ={'Weight': [45, 88, 56, 15, 71],'Name': ['Sam', 'Andrea', 'Alex', 'Robin', 'Kia'],'Age': [14, 25, 55, 8, 21]}
var5=pd.DataFrame(df,columns=["weight"],index=['a','b','c','d','e'])

print(var5)

   a  1
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
5  6  6
  weight
a    NaN
b    NaN
c    NaN
d    NaN
e    NaN

In [22]:
list_1=[[1,2,3,4,5],[11,12,13,14,15]]
var6=pd.DataFrame(list_1,index=["a",'b'])
print(var6)

    0   1   2   3   4
a   1   2   3   4   5
b  11  12  13  14  15

Arithmetic operations

In [23]:
import pandas as pd
var7= pd.DataFrame({"a":[1,2,3,4,5],"b":[2,3,4,5,6]})
var7["c"]=var7["a"]+var7["b"]
print(var7)

   a  b   c
0  1  2   3
1  2  3   5
2  3  4   7
3  4  5   9
4  5  6  11

In [24]:
var7["c"]=var7["a"]- var7["b"]
print(var7)

   a  b  c
0  1  2 -1
1  2  3 -1
2  3  4 -1
3  4  5 -1
4  5  6 -1

In [25]:
var7["c"]=var7["a"]* var7["b"]
print(var7)

   a  b   c
0  1  2   2
1  2  3   6
2  3  4  12
3  4  5  20
4  5  6  30

In [26]:
var7["python"]=var7["c"]<=5
print(var7)

   a  b   c  python
0  1  2   2    True
1  2  3   6   False
2  3  4  12   False
3  4  5  20   False
4  5  6  30   False

Delete and insert functions in python pandas

In [27]:
# insert
import pandas as pd
var8=pd.DataFrame({"a":[1,2,3,4,5],"b":[2,3,4,5,6]})
var8.insert(1,"python",var8["a"])
print(var8)

   a  python  b
0  1       1  2
1  2       2  3
2  3       3  4
3  4       4  5
4  5       5  6

In [28]:
import pandas as pd
var8=pd.DataFrame({"a":[1,2,3,4,5],"b":[2,3,4,5,6]})
var8.insert(1,"python",var8["a"])


var8.insert(1,"python_1",[11,12,13,14,15])
print(var8)

   a  python_1  python  b
0  1        11       1  2
1  2        12       2  3
2  3        13       3  4
3  4        14       4  5
4  5        15       5  6

In [29]:
var8["python_123"]=var8["a"][:3]
print(var8)

   a  python_1  python  b  python_123
0  1        11       1  2         1.0
1  2        12       2  3         2.0
2  3        13       3  4         3.0
3  4        14       4  5         NaN
4  5        15       5  6         NaN

Delete

In [30]:
var9=pd.DataFrame({"a":[1,2,3,4,5],"b":[2,3,4,5,6],"c":[11,12,13,14,15]}) 
print(var9)
print()
delete=var9.pop("b")
print(delete)

   a  b   c
0  1  2  11
1  2  3  12
2  3  4  13
3  4  5  14
4  5  6  15

0    2
1    3
2    4
3    5
4    6
Name: b, dtype: int64

In [31]:
print(var9)

   a   c
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [32]:
del var9["a"]
print(var9)

    c
0  11
1  12
2  13
3  14
4  15

Write csv using pandas (create a csv file)

csv format is a plain text format in which values are separate by commas (comma separated values)

XLS file format is an excel sheets binary file format which holds information about all the worksheets in a file, including both and formatting.

Write csv file

In [35]:
import pandas as pd
dis={"a":[1,2,3,4,5,6],"s":[1,2,3,4,5,6],"d":[1,2,3,4,5,6]}
d=pd.DataFrame(dis)
d.to_csv("Test_new.csv_1",index=False,header=["python","c++","java"])
print(d)

   a  s  d
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5
5  6  6  6

Read csv files in python pandas

A simple way to store big data sets is to use csv files(comma separated files)

csv files contains plain text and is a well know format that can be read by everyone including pandas.

In [37]:
import pandas as pd
csv_1 = pd.read_csv("Test_new.csv_1")

print(csv_1)
print(type(csv_1))

   python  c++  java
0       1    1     1
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6
<class 'pandas.core.frame.DataFrame'>

In [40]:
csv_1 = pd.read_csv("Test_new.csv_1",nrows=3)
print(csv_1)

   python  c++  java
0       1    1     1
1       2    2     2
2       3    3     3

In [41]:
csv_1 = pd.read_csv("Test_new.csv_1",usecols=[0,1] ) # columns name/ columns index  
print(csv_1)

   python  c++
0       1    1
1       2    2
2       3    3
3       4    4
4       5    5
5       6    6

In [42]:
csv_2 = pd.read_csv("Test_new.csv_1",skiprows=[2,1]) # rows  index  
print(csv_2)

   python  c++  java
0       3    3     3
1       4    4     4
2       5    5     5
3       6    6     6

In [43]:
csv_1 = pd.read_csv("Test_new.csv_1", index_col="python") # columns name/ columns index  
print(csv_1)

        c++  java
python
1         1     1
2         2     2
3         3     3
4         4     4
5         5     5
6         6     6

In [44]:
csv_3 = pd.read_csv("Test_new.csv_1",header=2) # row index  
print(csv_3)

   2  2.1  2.2
0  3    3    3
1  4    4    4
2  5    5    5
3  6    6    6

In [45]:
import pandas as pd
csv_4 = pd.read_csv("Test_new.csv_1",names=["a", "b", "c"])  
print(csv_4)

        a    b     c
0  python  c++  java
1       1    1     1
2       2    2     2
3       3    3     3
4       4    4     4
5       5    5     5
6       6    6     6

In [46]:
csv_5= pd.read_csv("Test_new.csv_1",dtype={"c++":"float"}) # change the data type
print(csv_5)

   python  c++  java
0       1  1.0     1
1       2  2.0     2
2       3  3.0     3
3       4  4.0     4
4       5  5.0     5
5       6  6.0     6

#  csv file function using pandas

In [48]:
import pandas as pd
csv_6=pd.read_csv("Test_new.csv_1") 
print(csv_6)

   python  c++  java
0       1    1     1
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6

In [49]:
csv_6.index

RangeIndex(start=0, stop=6, step=1)

In [50]:
csv_6.columns

Index(['python', 'c++', 'java'], dtype='object')

In [51]:
csv_6.describe()

         python       c++      java
count  6.000000  6.000000  6.000000
mean   3.500000  3.500000  3.500000
std    1.870829  1.870829  1.870829
min    1.000000  1.000000  1.000000
25%    2.250000  2.250000  2.250000
50%    3.500000  3.500000  3.500000
75%    4.750000  4.750000  4.750000
max    6.000000  6.000000  6.000000

In [52]:
csv_6.head(2)

   python  c++  java
0       1    1     1
1       2    2     2

In [53]:
csv_6.tail()

   python  c++  java
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6

In [54]:
  csv_6.tail(3)

   python  c++  java
3       4    4     4
4       5    5     5
5       6    6     6

In [55]:
# slicing
csv_6[1::2]

   python  c++  java
1       2    2     2
3       4    4     4
5       6    6     6

In [56]:
csv_6[1:4]

   python  c++  java
1       2    2     2
2       3    3     3
3       4    4     4

In [57]:
csv_6.index.array

<PandasArray>
[0, 1, 2, 3, 4, 5]
Length: 6, dtype: int64

In [58]:
csv_6.to_numpy()

array([[1, 1, 1],
       [2, 2, 2],
       [3, 3, 3],
       [4, 4, 4],
       [5, 5, 5],
       [6, 6, 6]], dtype=int64)

In [59]:
import numpy as np
v =np.asarray(csv_6)
v

array([[1, 1, 1],
       [2, 2, 2],
       [3, 3, 3],
       [4, 4, 4],
       [5, 5, 5],
       [6, 6, 6]], dtype=int64)

In [60]:
csv_6 .sort_index(axis=0,ascending=False)

   python  c++  java
5       6    6     6
4       5    5     5
3       4    4     4
2       3    3     3
1       2    2     2
0       1    1     1

In [61]:
csv_6.loc[0,"python"]="ankit" 
print(csv_6)

  python  c++  java
0  ankit    1     1
1      2    2     2
2      3    3     3
3      4    4     4
4      5    5     5
5      6    6     6

In [62]:
csv_6.loc[2,"python"]="31" # insert values
print(csv_6)

  python  c++  java
0  ankit    1     1
1      2    2     2
2     31    3     3
3      4    4     4
4      5    5     5
5      6    6     6

In [64]:
csv_7=pd.read_csv("Test_new.csv_1") # get values
csv_7.loc[[0],["python"]]

   python
0       1

In [23]:
csv_7.loc[[0,2],["python","c++"]]
csv_7

   python  c++  java
0       1    1     1
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6

In [65]:
import pandas as pd
csv_8=pd.read_csv("Test_new.csv_1")
csv_8.iloc[0,2] # get single value
print(csv_8)

   python  c++  java
0       1    1     1
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6

In [66]:
csv_8.iloc[0,2]

1

In [67]:

csv_8.drop("c++",axis=1) # rows=0/columns=1

   python  java
0       1     1
1       2     2
2       3     3
3       4     4
4       5     5
5       6     6

In [68]:
 csv_8.drop(0,axis=0)

   python  c++  java
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6

# handling missing values(dropna & fillna) in python pandas

In [72]:
# dropna & fillna
import pandas as pd
v=pd.read_csv("C:\\Users\\ankit\\OneDrive\\Desktop\\dataset.csv")
# v.dropna(axis=1) # rows=0/columns=1
# v.dropna(axis=0)
print(v)

    SR.      NAME  GENDER  AGE       DATE         COUNTRY
0     1      Dett    Male   18  21/05/2015  Great Britain
1     2     Nern   Female   19  15/10/2017         France
2     3   Kallsie    Male   20  16/08/2016         France
3     4     Siuau  Female   21  21/05/2015  Great Britain
4     5  Shennice    Male   22  21/05/2016         France
5     6    Chasse  Female   23  15/10/2018         France
6     7    Tommye    Male   24  16/08/2017  United States
7     8   Dorcast  Female   25  21/05/2016  United States
8     9   Angelee    Male   26  21/05/2017  Great Britain
9    10   Willoom  Female   27  15/10/2019         France
10   11   Waeston    Male   28  16/08/2018            NaN
11   12     Rosma  Female   29  21/05/2017            NaN
12   13  Felisaas    Male   30  21/05/2018            NaN
13   14   Demetas  Female   31  15/10/2020  Great Britain
14   15   Jeromyw  Female   32  16/08/2019         France
15   16    Rashid  Female   33  21/05/2018            NaN
16   17      Dett  Female   34  21/05/2019  United States
17   18     Nern   Female   35  15/10/2021            NaN
18   19   Kallsie  Female   36  16/08/2020            NaN
19   20     Siuau  Female   37  21/05/2019         France
20   21  Shennice  Female   38  21/05/2020            NaN
21   22    Chasse     NaN   39  15/10/2022         France
22   23    Tommye  Female   40  16/08/2021         France
23   24   Dorcast  Female   41  21/05/2020  Great Britain
24   25   Angelee  Female   42         NaN         France
25   26   Willoom  Female   43  15/10/2023         France
26   27   Waeston  Female   44  16/08/2022  United States
27   28     Rosma  Female   45  21/05/2021  United States
28   29  Felisaas  Female   46  21/05/2022  Great Britain
29   30   Demetas  Female   47  15/10/2024         France
30   31   Jeromyw  Female   48  16/08/2023  Great Britain
31   32    Rashid  Female   49  21/05/2022         France
32   33      Dett  Female   50  21/05/2023         France
33   34     Nern   Female   51  15/10/2025  Great Britain
34   35   Kallsie  Female   52  16/08/2024         France
35   36     Siuau  Female   53  21/05/2023         France
36   37  Shennice  Female   54  21/05/2024  United States
37   38    Chasse  Female   55  15/10/2026  United States
38   39    Tommye  Female   56  16/08/2025  Great Britain
39   40   Dorcast  Female   57  21/05/2024         France
40   41   Angelee  Female   58  21/05/2025  Great Britain
41   42   Willoom  Female   59  15/10/2027         France
42   43   Waeston  Female   60  16/08/2026         France
43   44     Rosma  Female   61  21/05/2025  Great Britain
44   45  Felisaas  Female   62  21/05/2026         France
45   46   Demetas  Female   63  15/10/2028         France
46   47   Jeromyw  Female   64  16/08/2027  United States
47   48    Rashid  Female   65  21/05/2026  United States
48   49      Dett    Male   18  21/05/2015  Great Britain

In [73]:
v.dropna(axis=1)

    SR.      NAME  AGE
0     1      Dett   18
1     2     Nern    19
2     3   Kallsie   20
3     4     Siuau   21
4     5  Shennice   22
5     6    Chasse   23
6     7    Tommye   24
7     8   Dorcast   25
8     9   Angelee   26
9    10   Willoom   27
10   11   Waeston   28
11   12     Rosma   29
12   13  Felisaas   30
13   14   Demetas   31
14   15   Jeromyw   32
15   16    Rashid   33
16   17      Dett   34
17   18     Nern    35
18   19   Kallsie   36
19   20     Siuau   37
20   21  Shennice   38
21   22    Chasse   39
22   23    Tommye   40
23   24   Dorcast   41
24   25   Angelee   42
25   26   Willoom   43
26   27   Waeston   44
27   28     Rosma   45
28   29  Felisaas   46
29   30   Demetas   47
30   31   Jeromyw   48
31   32    Rashid   49
32   33      Dett   50
33   34     Nern    51
34   35   Kallsie   52
35   36     Siuau   53
36   37  Shennice   54
37   38    Chasse   55
38   39    Tommye   56
39   40   Dorcast   57
40   41   Angelee   58
41   42   Willoom   59
42   43   Waeston   60
43   44     Rosma   61
44   45  Felisaas   62
45   46   Demetas   63
46   47   Jeromyw   64
47   48    Rashid   65
48   49      Dett   18

In [5]:
v.dropna(how="any") # All null value is remove

   python  c++  java
0       1    1     1
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6

In [6]:
v.dropna(how="all")  # remove null value in paricular rows

   python  c++  java
0       1    1     1
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6

In [7]:
v.dropna(subset=["c++"]) # columns wise

   python  c++  java
0       1    1     1
1       2    2     2
2       3    3     3
3       4    4     4
4       5    5     5
5       6    6     6

In [9]:
v.dropna(inplace=True) # all null value remove

In [2]:
import pandas as pd

va=pd.read_csv("Free_Test_Data_200KB_CSV-1 (3).csv")
print(va)

    SR.      NAME  GENDER  AGE       DATE         COUNTRY
0     1      Dett    Male   18  21/05/2015  Great Britain
1     2     Nern   Female   19  15/10/2017         France
2     3   Kallsie    Male   20  16/08/2016         France
3     4     Siuau  Female   21  21/05/2015  Great Britain
4     5  Shennice    Male   22  21/05/2016         France
5     6    Chasse  Female   23  15/10/2018         France
6     7    Tommye    Male   24  16/08/2017  United States
7     8   Dorcast  Female   25  21/05/2016  United States
8     9   Angelee    Male   26  21/05/2017  Great Britain
9    10   Willoom  Female   27  15/10/2019         France
10   11   Waeston    Male   28  16/08/2018  Great Britain
11   12     Rosma  Female   29  21/05/2017         France
12   13  Felisaas    Male   30  21/05/2018         France
13   14   Demetas  Female   31  15/10/2020  Great Britain
14   15   Jeromyw  Female   32  16/08/2019         France
15   16    Rashid  Female   33  21/05/2018         France
16   17      Dett  Female   34  21/05/2019  United States
17   18     Nern   Female   35  15/10/2021  United States
18   19   Kallsie  Female   36  16/08/2020  Great Britain
19   20     Siuau  Female   37  21/05/2019         France
20   21  Shennice  Female   38  21/05/2020  Great Britain
21   22    Chasse  Female   39  15/10/2022         France
22   23    Tommye  Female   40  16/08/2021         France
23   24   Dorcast  Female   41  21/05/2020  Great Britain
24   25   Angelee  Female   42  21/05/2021         France
25   26   Willoom  Female   43  15/10/2023         France
26   27   Waeston  Female   44  16/08/2022  United States
27   28     Rosma  Female   45  21/05/2021  United States
28   29  Felisaas  Female   46  21/05/2022  Great Britain
29   30   Demetas  Female   47  15/10/2024         France
30   31   Jeromyw  Female   48  16/08/2023  Great Britain
31   32    Rashid  Female   49  21/05/2022         France
32   33      Dett  Female   50  21/05/2023         France
33   34     Nern   Female   51  15/10/2025  Great Britain
34   35   Kallsie  Female   52  16/08/2024         France
35   36     Siuau  Female   53  21/05/2023         France
36   37  Shennice  Female   54  21/05/2024  United States
37   38    Chasse  Female   55  15/10/2026  United States
38   39    Tommye  Female   56  16/08/2025  Great Britain
39   40   Dorcast  Female   57  21/05/2024         France
40   41   Angelee  Female   58  21/05/2025  Great Britain
41   42   Willoom  Female   59  15/10/2027         France
42   43   Waeston  Female   60  16/08/2026         France
43   44     Rosma  Female   61  21/05/2025  Great Britain
44   45  Felisaas  Female   62  21/05/2026         France
45   46   Demetas  Female   63  15/10/2028         France
46   47   Jeromyw  Female   64  16/08/2027  United States
47   48    Rashid  Female   65  21/05/2026  United States
48   49      Dett    Male   18  21/05/2015  Great Britain

In [4]:
va.dropna(axis=1)

    SR.      NAME  GENDER  AGE       DATE         COUNTRY
0     1      Dett    Male   18  21/05/2015  Great Britain
1     2     Nern   Female   19  15/10/2017         France
2     3   Kallsie    Male   20  16/08/2016         France
3     4     Siuau  Female   21  21/05/2015  Great Britain
4     5  Shennice    Male   22  21/05/2016         France
5     6    Chasse  Female   23  15/10/2018         France
6     7    Tommye    Male   24  16/08/2017  United States
7     8   Dorcast  Female   25  21/05/2016  United States
8     9   Angelee    Male   26  21/05/2017  Great Britain
9    10   Willoom  Female   27  15/10/2019         France
10   11   Waeston    Male   28  16/08/2018  Great Britain
11   12     Rosma  Female   29  21/05/2017         France
12   13  Felisaas    Male   30  21/05/2018         France
13   14   Demetas  Female   31  15/10/2020  Great Britain
14   15   Jeromyw  Female   32  16/08/2019         France
15   16    Rashid  Female   33  21/05/2018         France
16   17      Dett  Female   34  21/05/2019  United States
17   18     Nern   Female   35  15/10/2021  United States
18   19   Kallsie  Female   36  16/08/2020  Great Britain
19   20     Siuau  Female   37  21/05/2019         France
20   21  Shennice  Female   38  21/05/2020  Great Britain
21   22    Chasse  Female   39  15/10/2022         France
22   23    Tommye  Female   40  16/08/2021         France
23   24   Dorcast  Female   41  21/05/2020  Great Britain
24   25   Angelee  Female   42  21/05/2021         France
25   26   Willoom  Female   43  15/10/2023         France
26   27   Waeston  Female   44  16/08/2022  United States
27   28     Rosma  Female   45  21/05/2021  United States
28   29  Felisaas  Female   46  21/05/2022  Great Britain
29   30   Demetas  Female   47  15/10/2024         France
30   31   Jeromyw  Female   48  16/08/2023  Great Britain
31   32    Rashid  Female   49  21/05/2022         France
32   33      Dett  Female   50  21/05/2023         France
33   34     Nern   Female   51  15/10/2025  Great Britain
34   35   Kallsie  Female   52  16/08/2024         France
35   36     Siuau  Female   53  21/05/2023         France
36   37  Shennice  Female   54  21/05/2024  United States
37   38    Chasse  Female   55  15/10/2026  United States
38   39    Tommye  Female   56  16/08/2025  Great Britain
39   40   Dorcast  Female   57  21/05/2024         France
40   41   Angelee  Female   58  21/05/2025  Great Britain
41   42   Willoom  Female   59  15/10/2027         France
42   43   Waeston  Female   60  16/08/2026         France
43   44     Rosma  Female   61  21/05/2025  Great Britain
44   45  Felisaas  Female   62  21/05/2026         France
45   46   Demetas  Female   63  15/10/2028         France
46   47   Jeromyw  Female   64  16/08/2027  United States
47   48    Rashid  Female   65  21/05/2026  United States
48   49      Dett    Male   18  21/05/2015  Great Britain

In [8]:
va1=pd.read_csv("C:\\Users\\ankit\\OneDrive\\Desktop\\dataset.csv")
print(va1)

    SR.      NAME  GENDER  AGE       DATE         COUNTRY
0     1      Dett    Male   18  21/05/2015  Great Britain
1     2     Nern   Female   19  15/10/2017         France
2     3   Kallsie    Male   20  16/08/2016         France
3     4     Siuau  Female   21  21/05/2015  Great Britain
4     5  Shennice    Male   22  21/05/2016         France
5     6    Chasse  Female   23  15/10/2018         France
6     7    Tommye    Male   24  16/08/2017  United States
7     8   Dorcast  Female   25  21/05/2016  United States
8     9   Angelee    Male   26  21/05/2017  Great Britain
9    10   Willoom  Female   27  15/10/2019         France
10   11   Waeston    Male   28  16/08/2018            NaN
11   12     Rosma  Female   29  21/05/2017            NaN
12   13  Felisaas    Male   30  21/05/2018            NaN
13   14   Demetas  Female   31  15/10/2020  Great Britain
14   15   Jeromyw  Female   32  16/08/2019         France
15   16    Rashid  Female   33  21/05/2018         France
16   17      Dett  Female   34  21/05/2019  United States
17   18     Nern   Female   35  15/10/2021  United States
18   19   Kallsie  Female   36  16/08/2020            NaN
19   20     Siuau  Female   37  21/05/2019         France
20   21  Shennice  Female   38  21/05/2020  Great Britain
21   22    Chasse  Female   39  15/10/2022         France
22   23    Tommye  Female   40  16/08/2021         France
23   24   Dorcast  Female   41  21/05/2020  Great Britain
24   25   Angelee  Female   42  21/05/2021         France
25   26   Willoom  Female   43  15/10/2023         France
26   27   Waeston  Female   44  16/08/2022  United States
27   28     Rosma  Female   45  21/05/2021  United States
28   29  Felisaas  Female   46  21/05/2022  Great Britain
29   30   Demetas  Female   47  15/10/2024         France
30   31   Jeromyw  Female   48  16/08/2023  Great Britain
31   32    Rashid  Female   49  21/05/2022         France
32   33      Dett  Female   50  21/05/2023         France
33   34     Nern   Female   51  15/10/2025  Great Britain
34   35   Kallsie  Female   52  16/08/2024         France
35   36     Siuau  Female   53  21/05/2023         France
36   37  Shennice  Female   54  21/05/2024  United States
37   38    Chasse  Female   55  15/10/2026  United States
38   39    Tommye  Female   56  16/08/2025  Great Britain
39   40   Dorcast  Female   57  21/05/2024         France
40   41   Angelee  Female   58  21/05/2025  Great Britain
41   42   Willoom  Female   59  15/10/2027         France
42   43   Waeston  Female   60  16/08/2026         France
43   44     Rosma  Female   61  21/05/2025  Great Britain
44   45  Felisaas  Female   62  21/05/2026         France
45   46   Demetas  Female   63  15/10/2028         France
46   47   Jeromyw  Female   64  16/08/2027  United States
47   48    Rashid  Female   65  21/05/2026  United States
48   49      Dett    Male   18  21/05/2015  Great Britain

In [9]:
print(va1)

    SR.      NAME  GENDER  AGE       DATE         COUNTRY
0     1      Dett    Male   18  21/05/2015  Great Britain
1     2     Nern   Female   19  15/10/2017         France
2     3   Kallsie    Male   20  16/08/2016         France
3     4     Siuau  Female   21  21/05/2015  Great Britain
4     5  Shennice    Male   22  21/05/2016         France
5     6    Chasse  Female   23  15/10/2018         France
6     7    Tommye    Male   24  16/08/2017  United States
7     8   Dorcast  Female   25  21/05/2016  United States
8     9   Angelee    Male   26  21/05/2017  Great Britain
9    10   Willoom  Female   27  15/10/2019         France
10   11   Waeston    Male   28  16/08/2018            NaN
11   12     Rosma  Female   29  21/05/2017            NaN
12   13  Felisaas    Male   30  21/05/2018            NaN
13   14   Demetas  Female   31  15/10/2020  Great Britain
14   15   Jeromyw  Female   32  16/08/2019         France
15   16    Rashid  Female   33  21/05/2018         France
16   17      Dett  Female   34  21/05/2019  United States
17   18     Nern   Female   35  15/10/2021  United States
18   19   Kallsie  Female   36  16/08/2020            NaN
19   20     Siuau  Female   37  21/05/2019         France
20   21  Shennice  Female   38  21/05/2020  Great Britain
21   22    Chasse  Female   39  15/10/2022         France
22   23    Tommye  Female   40  16/08/2021         France
23   24   Dorcast  Female   41  21/05/2020  Great Britain
24   25   Angelee  Female   42  21/05/2021         France
25   26   Willoom  Female   43  15/10/2023         France
26   27   Waeston  Female   44  16/08/2022  United States
27   28     Rosma  Female   45  21/05/2021  United States
28   29  Felisaas  Female   46  21/05/2022  Great Britain
29   30   Demetas  Female   47  15/10/2024         France
30   31   Jeromyw  Female   48  16/08/2023  Great Britain
31   32    Rashid  Female   49  21/05/2022         France
32   33      Dett  Female   50  21/05/2023         France
33   34     Nern   Female   51  15/10/2025  Great Britain
34   35   Kallsie  Female   52  16/08/2024         France
35   36     Siuau  Female   53  21/05/2023         France
36   37  Shennice  Female   54  21/05/2024  United States
37   38    Chasse  Female   55  15/10/2026  United States
38   39    Tommye  Female   56  16/08/2025  Great Britain
39   40   Dorcast  Female   57  21/05/2024         France
40   41   Angelee  Female   58  21/05/2025  Great Britain
41   42   Willoom  Female   59  15/10/2027         France
42   43   Waeston  Female   60  16/08/2026         France
43   44     Rosma  Female   61  21/05/2025  Great Britain
44   45  Felisaas  Female   62  21/05/2026         France
45   46   Demetas  Female   63  15/10/2028         France
46   47   Jeromyw  Female   64  16/08/2027  United States
47   48    Rashid  Female   65  21/05/2026  United States
48   49      Dett    Male   18  21/05/2015  Great Britain